Revit 2024 API
ComboBoxCurrentChangedEventArgs.NewValue Property
The current item for the ComboBox after the change.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ComboBoxMember NewValue { get; }
Visual Basic
Public ReadOnly Property NewValue As ComboBoxMember
	Get
Visual C++
public:
property ComboBoxMember^ NewValue {
	ComboBoxMember^ get ();
}
See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace